def fibs(n):
    # у нас есть два числа, a и b,
    a, b = 0, 0
    # начинаем бесконечный цикл с этими числами,
    while True:
        # проверяем значения a и b,
        if not a and not b:
            # если условие выполняется,
            # изменяем значение b,
            b += 1
            # отдаём в итератор 0
            yield 0
            # и уходим на следующий шаг
            # бесконечного цикла,
        # на следующем шаге бесконечного цикла
        # первое условие не выполнится, так как
        # b имеет значение 1
        # проверяем второе условие
        if not a and b == 1:
            # если условие выполняется, отдаём в
            # итератор единицу
            yield 1
            # и уходим на следующий шаг
            # бесконечного цикла,
        # на следующем шаге бесконечного цикла
        # первые два условия не будут выполнены,
        # создаём переменную c и присваиваем ей
        # сумму значений a и b,
        c = a + b
        # проверяем значение переменной c,
        if c <= n:
            # если условие выполняется,
            # отдаём в итератор значение c,
            yield c
            # даём переменным a и b новые значения
            a, b = b, c
            # и уходим на следующий шаг
            # бесконечного цикла,
        else:
            # если же условие не выполняется,
            # прерываем бесконечный цикл
            break
