"""
Вариант 11
Основанием прямой треугольной призмы служит прямоугольный треугольник с катетами a и b. 
Площадь ее поверхности равна s. Найдите высоту призмы. 
Решение оформите в виде функции height(a,b,s), которая возвращает значение переменной h. 
Например, при a=6; b=8; s=288 функция height(6,8,288) выдает h=10.
"""
import math

def height(a, b, s):
    return (s-a*b)/(a+b+math.sqrt(a*a+b*b))

def main():
    a = int(input("Введите сторону треугольника a = "))
    b = int(input("Введите сторону треугольника b = "))
    s = int(input("Введите площадь призмы s = "))
    print(height(a, b, s))

main()